---
kind: property
id: P:Autodesk.Revit.DB.ImageBackgroundSettings.OffsetHeight
source: html/cd807380-5e1c-ce56-36f6-9e4236bd907b.htm
---
# Autodesk.Revit.DB.ImageBackgroundSettings.OffsetHeight Property

The vertical offset of the rendering image to the rendering region.

## Syntax (C#)
```csharp
public double OffsetHeight { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for height must be no more than 30000 feet in absolute value.